/*Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1*/

Console.WriteLine("Введите число");
string Find2ndDigit = Console.ReadLine();
Console.WriteLine(Find2ndDigit[1]);